app/controllers/book_comments_controller.rb

  def create
    @book = Book.find(params[:book_id])
    book_comment = BookComment.create(book_comment_params)
    redirect_to book_path(book_comment.book.id)
    @book_comment = BookComment.new
    @book_comments = @book.comments.includes(:user)
    if @book_comment.save
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
INSERT INTO "book_comments" ("created_at", "updated_at", "user_id", "book_id", "comment") VALUES (?, ?, ?, ?, ?)  [["created_at", "2021-04-03 10:40:51.364470"], ["updated_at", "2021-04-03 10:40:51.364470"], ["user_id", 2], ["book_id", 7], ["comment", "uuuu"]]
SELECT  "book_comments".* FROM "book_comments" WHERE "book_comments"."user_id" = ? AND "book_comments"."book_id" = ? LIMIT ?  [["user_id", 2], ["book_id", 9], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 2], ["LIMIT", 1]]

  def destroy
    @book = Book.find(params[:id])
    @book_comment = current_user.book_comments.find_by(book_id: @book.id)
    @book_comment.destroy
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
SELECT  "book_comments".* FROM "book_comments" WHERE "book_comments"."user_id" = ? AND "book_comments"."book_id" = ? LIMIT ?  [["user_id", 2], ["book_id", 9], ["LIMIT", 1]]
DELETE FROM "book_comments" WHERE "book_comments"."id" = ?  [["id", 8]]