app/controllers/favorites_controller.rb

  def create
    book = Book.find(params[:book_id])
    favorite = current_user.favorites.new(book_id: book.id)
    favorite.save
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
INSERT INTO "favorites" ("created_at", "updated_at", "book_id", "user_id") VALUES (?, ?, ?, ?)  [["created_at", "2021-04-03 06:45:53.256422"], ["updated_at", "2021-04-03 06:45:53.256422"], ["book_id", 17], ["user_id", 2]]