app/models/user.rb

def following?(user)
  following_user.include?(user)
---
SELECT  1 AS one FROM "users" INNER JOIN "relationships" ON "users"."id" = "relationships"."follower_id" WHERE "relationships"."user_id" = ? AND "users"."id" = ? LIMIT ?  [["user_id", 3], ["id", 1], ["LIMIT", 1]]